app/controllers/resers_controller.rb

SELECT "resers".* FROM "resers"
---
  def index
    @resers = Reser.all

INSERT INTO "resers" ("fname", "lnome", "email", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fname", "s"], ["lnome", "ss"], ["email", "s"], ["phone", "s"], ["address", "s"], ["created_at", "2019-01-09 03:24:30.166838"], ["updated_at", "2019-01-09 03:24:30.166838"]]
---
  def create
    @reser = Reser.new(reser_params)

    respond_to do |format|
      if @reser.save

UPDATE "resers" SET "address" = $1, "updated_at" = $2 WHERE "resers"."id" = $3  [["address", "hesi@prmaqwqdqwdqwdil.top"], ["updated_at", "2019-01-10 13:52:28.182649"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @reser.update(reser_params)

DELETE FROM "resers" WHERE "resers"."id" = $1  [["id", 4]]
---
  def destroy
    @reser.destroy

SELECT  "resers".* FROM "resers" WHERE "resers"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def set_reser
      @reser = Reser.find(params[:id])